five9ApiIntegration/five9ApiIntegration/testRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.admin.ws.five9.com/">
	<soapenv:Header/>
	<soapenv:Body>
		<ser:runReport>
			<folderName>My Reports</folderName>
			<reportName>James Test Matrix</reportName>
			<criteria>
				<time>
					<end>2020-05-10T23:00:00.000-07:00</end>
					<start>2020-05-01T00:00:00.000-07:00</start>
				</time>
			</criteria>
		</ser:runReport>
	</soapenv:Body>
</soapenv:Envelope>